# RebarSystemBarTypeBackDirn1 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemBarTypeBackDirn1 Property
ParameterTypeId Class See Also
---
"Interior Major Bar Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemBarTypeBackDirn1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemBarTypeBackDirn1 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemBarTypeBackDirn1 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace